Revit 2027 API
StructuralAsset.Copy Method
 Produces a copy of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralAsset Copy()
Public Function Copy As StructuralAsset
public:
StructuralAsset^ Copy()
member Copy : unit -> StructuralAsset
Return Value
StructuralAsset
 A copy of the asset.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace